#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.commons.azurerm_key_vault_access_policy.app_gateway_policy will be created
  + resource "azurerm_key_vault_access_policy" "app_gateway_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-sec-rg-01/providers/Microsoft.KeyVault/vaults/ts-p-itn-kv-01"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.commons.azurerm_role_assignment.subs_asyn_create_queue will be destroyed
  # (because azurerm_role_assignment.subs_asyn_create_queue is not in configuration)
  - resource "azurerm_role_assignment" "subs_asyn_create_queue" {
      - id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/providers/Microsoft.Authorization/roleAssignments/094be49f-bd3f-a1c3-bf5a-096742086c23" -> null
      - name                 = "094be49f-bd3f-a1c3-bf5a-096742086c23" -> null
      - principal_id         = "6330a71f-6069-4a04-b800-b847dbd3eb8c" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/74122b28-657a-62e0-335a-9a4bcf81540d" -> null
      - role_definition_name = "Service Bus Create Queue" -> null
      - scope                = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb" -> null
    }

  # module.commons.azurerm_role_assignment.subs_asyn_create_subscription will be destroyed
  # (because azurerm_role_assignment.subs_asyn_create_subscription is not in configuration)
  - resource "azurerm_role_assignment" "subs_asyn_create_subscription" {
      - id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events/providers/Microsoft.Authorization/roleAssignments/d1996e50-4939-3bc0-cca1-f0a332897d7e" -> null
      - name                 = "d1996e50-4939-3bc0-cca1-f0a332897d7e" -> null
      - principal_id         = "6330a71f-6069-4a04-b800-b847dbd3eb8c" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/4347d346-5fd6-ad39-d06c-6de469b93e4c" -> null
      - role_definition_name = "Service Bus Create Subscription" -> null
      - scope                = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" -> null
    }

  # module.commons.azurerm_role_assignment.subs_asyn_create_user_assigned_identity will be destroyed
  # (because azurerm_role_assignment.subs_asyn_create_user_assigned_identity is not in configuration)
  - resource "azurerm_role_assignment" "subs_asyn_create_user_assigned_identity" {
      - id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.Authorization/roleAssignments/1f744751-ba5e-2ffb-48e4-4a547cfb432d" -> null
      - name                 = "1f744751-ba5e-2ffb-48e4-4a547cfb432d" -> null
      - principal_id         = "6330a71f-6069-4a04-b800-b847dbd3eb8c" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/e40ec5ca-96e0-45a2-b4ff-59039f2c2b59" -> null
      - role_definition_name = "Managed Identity Contributor" -> null
      - scope                = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01" -> null
    }

  # module.commons.azurerm_role_definition.subs_asyn_create_queue will be destroyed
  # (because azurerm_role_definition.subs_asyn_create_queue is not in configuration)
  - resource "azurerm_role_definition" "subs_asyn_create_queue" {
      - assignable_scopes           = [
          - "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb",
        ] -> null
      - description                 = "Custom role that allow to create a Service Bus queue" -> null
      - id                          = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/74122b28-657a-62e0-335a-9a4bcf81540d|/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb" -> null
      - name                        = "Service Bus Create Queue" -> null
      - role_definition_id          = "74122b28-657a-62e0-335a-9a4bcf81540d" -> null
      - role_definition_resource_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/74122b28-657a-62e0-335a-9a4bcf81540d" -> null
      - scope                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb" -> null

      - permissions {
          - actions          = [
              - "Microsoft.ServiceBus/namespaces/queues/write",
            ] -> null
          - data_actions     = [] -> null
          - not_actions      = [] -> null
          - not_data_actions = [] -> null
        }
    }

  # module.commons.azurerm_role_definition.subs_asyn_create_subscription will be destroyed
  # (because azurerm_role_definition.subs_asyn_create_subscription is not in configuration)
  - resource "azurerm_role_definition" "subs_asyn_create_subscription" {
      - assignable_scopes           = [
          - "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events",
        ] -> null
      - description                 = "Custom role that allow to create a Topic Subscription" -> null
      - id                          = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/4347d346-5fd6-ad39-d06c-6de469b93e4c|/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" -> null
      - name                        = "Service Bus Create Subscription" -> null
      - role_definition_id          = "4347d346-5fd6-ad39-d06c-6de469b93e4c" -> null
      - role_definition_resource_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/4347d346-5fd6-ad39-d06c-6de469b93e4c" -> null
      - scope                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" -> null

      - permissions {
          - actions          = [
              - "Microsoft.ServiceBus/namespaces/topics/subscriptions/write",
            ] -> null
          - data_actions     = [] -> null
          - not_actions      = [] -> null
          - not_data_actions = [] -> null
        }
    }

  # module.commons.azurerm_user_assigned_identity.appgateway will be created
  + resource "azurerm_user_assigned_identity" "appgateway" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "ts-p-itn-appgateway-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "ts-p-itn-sec-rg-01"
      + tags                = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
      + tenant_id           = (known after apply)
    }

  # module.commons.module.app_gw.azurerm_application_gateway.this will be created
  + resource "azurerm_application_gateway" "this" {
      + id                          = (known after apply)
      + location                    = "italynorth"
      + name                        = "ts-p-itn-agw-01"
      + private_endpoint_connection = (known after apply)
      + resource_group_name         = "ts-p-itn-routing-rg-01"
      + tags                        = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
      + zones                       = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 1
        }

      + backend_address_pool {
          + fqdns        = [
              + "https://ts-p-itn-apim-01.azure-api.net",
            ]
          + id           = (known after apply)
          + ip_addresses = []
          + name         = "apim-address-pool"
        }

      + backend_http_settings {
          + affinity_cookie_name                = "ApplicationGatewayAffinity"
          + cookie_based_affinity               = "Disabled"
          + host_name                           = "ts-p-itn-apim-01.azure-api.net"
          + id                                  = (known after apply)
          + name                                = "apim-http-settings"
          + pick_host_name_from_backend_address = false
          + port                                = 443
          + probe_id                            = (known after apply)
          + probe_name                          = "probe-apim"
          + protocol                            = "Https"
          + request_timeout                     = 180
          + trusted_root_certificate_names      = []
        }

      + frontend_ip_configuration {
          + id                            = (known after apply)
          + name                          = "ts-p-itn-agw-01-ip-conf"
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "Dynamic"
          + private_link_configuration_id = (known after apply)
          + public_ip_address_id          = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.Network/publicIPAddresses/ts-p-itn-appgateway-pip-01"
        }

      + frontend_port {
          + id   = (known after apply)
          + name = "ts-p-itn-agw-01-443-port"
          + port = 443
        }

      + gateway_ip_configuration {
          + id        = (known after apply)
          + name      = "ts-p-itn-agw-01-snet-conf"
          + subnet_id = (known after apply)
        }

      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "ts-p-itn-agw-01-ip-conf"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "ts-p-itn-agw-01-443-port"
          + host_name                      = "api.trial.pagopa.it"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "api-trial-pagopa-it-listener"
          + protocol                       = "Https"
          + require_sni                    = true
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "api-trial-pagopa-it"
          + ssl_profile_id                 = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + probe {
          + host                                      = "ts-p-itn-apim-01.azure-api.net"
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "probe-apim"
          + path                                      = "/status-0123456789abcdef"
          + pick_host_name_from_backend_http_settings = false
          + protocol                                  = "Https"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3

          + match {
              + status_code = [
                  + "200-399",
                ]
            }
        }

      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "apim-address-pool"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "apim-http-settings"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "api-trial-pagopa-it-listener"
          + id                         = (known after apply)
          + name                       = "api-trial-pagopa-it-reqs-routing-rule"
          + priority                   = 50
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "rewrite-rule-set-api"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "rewrite-rule-set-api"

          + rewrite_rule {
              + name          = "http-headers-api"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_client_ip}"
                }
              + request_header_configuration {
                  + header_name  = "X-Client-Ip"
                  + header_value = "{var_client_ip}"
                }
            }
        }

      + sku {
          + name = "WAF_v2"
          + tier = "WAF_v2"
        }

      + ssl_certificate {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + ssl_policy {
          + cipher_suites        = [
              + "TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256",
              + "TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384",
            ]
          + min_protocol_version = "TLSv1_2"
          + policy_type          = "Custom"
        }

      + ssl_profile {
          + id                           = (known after apply)
          + name                         = "ts-p-itn-ssl-profile"
          + verify_client_cert_issuer_dn = false

          + ssl_policy {
              + cipher_suites        = [
                  + "TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256",
                  + "TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384",
                ]
              + disabled_protocols   = []
              + min_protocol_version = "TLSv1_2"
              + policy_type          = "Custom"
            }
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Detection"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.1"
        }
    }

  # module.commons.module.app_gw.azurerm_monitor_metric_alert.this["backend_pools_status"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "One or more backend pools are down, see Dimension value or check Backend Health on Azure portal. Runbook https://pagopa.atlassian.net/wiki/spaces/IC/pages/914161665/Application+Gateway+-+Backend+Status"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "ts-p-itn-agw-01-BACKEND_POOLS_STATUS"
      + resource_group_name      = "ts-p-itn-routing-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "UnhealthyHostCount"
          + metric_namespace       = "Microsoft.Network/applicationgateways"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0

          + dimension {
              + name     = "BackendSettingsPool"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.commons.module.app_gw.azurerm_monitor_metric_alert.this["compute_units_usage"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "Abnormal compute units usage, probably an high traffic peak"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "ts-p-itn-agw-01-COMPUTE_UNITS_USAGE"
      + resource_group_name      = "ts-p-itn-routing-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

      + dynamic_criteria {
          + aggregation              = "Average"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 3
          + evaluation_total_count   = 3
          + metric_name              = "ComputeUnits"
          + metric_namespace         = "Microsoft.Network/applicationgateways"
          + operator                 = "GreaterOrLessThan"
        }
    }

  # module.commons.module.app_gw.azurerm_monitor_metric_alert.this["failed_requests"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "Abnormal failed requests. See Dimension value to check the Backend Pool unhealty"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "ts-p-itn-agw-01-FAILED_REQUESTS"
      + resource_group_name      = "ts-p-itn-routing-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 1
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "High"
          + evaluation_failure_count = 4
          + evaluation_total_count   = 4
          + metric_name              = "FailedRequests"
          + metric_namespace         = "Microsoft.Network/applicationgateways"
          + operator                 = "GreaterThan"

          + dimension {
              + name     = "BackendSettingsPool"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.commons.module.app_gw.azurerm_monitor_metric_alert.this["response_time"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "Backends response time is too high. See Dimension value to check the Listener unhealty."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "ts-p-itn-agw-01-RESPONSE_TIME"
      + resource_group_name      = "ts-p-itn-routing-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 2
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

      + dynamic_criteria {
          + aggregation              = "Average"
          + alert_sensitivity        = "Medium"
          + evaluation_failure_count = 2
          + evaluation_total_count   = 2
          + metric_name              = "BackendLastByteResponseTime"
          + metric_namespace         = "Microsoft.Network/applicationgateways"
          + operator                 = "GreaterThan"

          + dimension {
              + name     = "Listener"
              + operator = "Include"
              + values   = [
                  + "*",
                ]
            }
        }
    }

  # module.commons.module.app_gw.azurerm_monitor_metric_alert.this["total_requests"] will be created
  + resource "azurerm_monitor_metric_alert" "this" {
      + auto_mitigate            = true
      + description              = "Traffic is raising"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "ts-p-itn-agw-01-TOTAL_REQUESTS"
      + resource_group_name      = "ts-p-itn-routing-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 3
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/Microsoft.Insights/actionGroups/tsperror01"
        }

      + dynamic_criteria {
          + aggregation              = "Total"
          + alert_sensitivity        = "Medium"
          + evaluation_failure_count = 1
          + evaluation_total_count   = 1
          + metric_name              = "TotalRequests"
          + metric_namespace         = "Microsoft.Network/applicationgateways"
          + operator                 = "GreaterThan"
        }
    }

  # module.commons.module.appgateway_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.30.10.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "ts-p-itn-agw-snet-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "ts-p-itn-routing-rg-01"
      + virtual_network_name                           = "ts-p-itn-vnet-01"
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01"
        name                                           = "ts-p-itn-subscription-fn-01"
      ~ public_network_access_enabled                  = true -> false
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Platform"
            "Owner"                                          = "TRIAL"
            "Source"                                         = "https://github.com/pagopa/trial-system"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=048770ed-3c3c-4b85-a24c-3f2e17228823;IngestionEndpoint=https://italynorth-0.in.applicationinsights.azure.com/;LiveEndpoint=https://italynorth.livediagnostics.monitor.azure.com/;ApplicationId=010aac71-4c33-4b73-ad13-fb71d9d608fb"
            "hidden-link: /app-insights-instrumentation-key" = "048770ed-3c3c-4b85-a24c-3f2e17228823"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-monitor-rg-01/providers/microsoft.insights/components/ts-p-itn-trial-ai-01"
        }
        # (27 unchanged attributes hidden)

      ~ site_config {
          ~ ip_restriction_default_action           = "Deny" -> "Allow"
            # (26 unchanged attributes hidden)

          - ip_restriction {
              - action     = "Allow" -> null
              - headers    = [] -> null
              - ip_address = "93.56.160.203/32" -> null
              - name       = "Local" -> null
              - priority   = 300 -> null
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 9 to add, 2 to change, 5 to destroy.

Warning: Argument is deprecated

  with module.commons.module.apim.azurerm_monitor_diagnostic_setting.apim,
  on .terraform/modules/commons.apim/api_management/main.tf line 355, in resource "azurerm_monitor_diagnostic_setting" "apim":
 355: resource "azurerm_monitor_diagnostic_setting" "apim" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 16 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/commons.cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
